Repository: pepr/progit2-cs
Catalog: omegat/ScottChacon_ProGit2-omegat.tmx
Source language: en
Languages: cs

source: Again, this gives you normal `log` output but shows you only the commit information for those four commits, appearing in the traditional commit date ordering.
cs: Výstupem příkazu bude běžný výpis příkazu `log`, ale zobrazí se pouze informace o těchto čtyřech revizích, uspořádané v tradičním pořadí podle data zapsání.

source: Again, this will cause a `git push origin` to push the local `master` branch to the remote `qa/master` branch by default.
cs: Touto hodnotou zajistíte, že bude příkaz `git push origin` odesílat lokální větev `master` do vzdálené větve `qa/master`.

source: Again, you need to do this only once if you pass the `--global` option, because then Git will always use that information for anything you do on that system.
cs: Použijete-li parametr `--global`, pak také toto nastavení stačí provést pouze jednou. Git bude používat tyto údaje pro všechny operace, které na daném počítači uděláte.

source: All of these fields are delimited by a pipe (`|`) character.
cs: Všechna tato pole jsou oddělena svislicí (`|`).

source: All the content is stored as tree and blob objects, with trees corresponding to UNIX directory entries and blobs corresponding more or less to inodes or file contents.
cs: Veškerý obsah se ukládá v podobě objektů typu strom a blob. Stromy odpovídají položkám v adresáři UNIX a bloby víceméně odpovídají i-uzlům nebo obsahům souborů.

source: All the lieutenants have one integration manager known as the benevolent dictator.
cs: Všichni poručíci mají jednoho integračního manažera, kterému se říká benevolentní diktátor.

source: All these questions can affect how you contribute effectively to a project and what workflows are preferred or available to you.
cs: Všechny tyto otázky mohou mít vliv na efektivní přispívání do projektu a určují, jaký pracovní postup je vůbec možný a který bude upřednostněn.

source: All you have to do is check out the branch you wish to merge into and then run the `git merge` command:
cs: Jediné, co pro to musíte udělat, je přepnout na větev, do které chcete tuto větev začlenit, a potom spustit příkaz `git merge`.

source: All you have to do is switch back to your `master` branch.
cs: Vše, co musíte udělat, je přepnout se zpět na větev `master`.

source: All you have to do is tell `fast-import` what the content snapshots are, what commit data points to them, and the order they go in.
cs: Jediné, co tedy musíte udělat, je sdělit příkazu `fast-import`, co je obsahem snímků, jaká data revizí na ně ukazují a pořadí, v němž budou převzaty.

source: All you have to do is use `-s` instead of `-a`:
cs: Jediné, co pro to musíte udělat, je zadat místo parametru `-a` parametr `-s`:

source: All your branches and tags should be on your new Git server in a nice, clean import.
cs: Na novém serveru Git tak nyní máte v úhledném, čistém importu uloženy všechny větve a značky.

source: Also note the `^4832fe2` commit lines, which designate that those lines were in this file’s original commit.
cs: Všimněte si také řádků revize `^4832fe2`, které oznamují, že tyto řádky byly obsaženy v originální revizi tohoto souboru.

source: Also notice the `-u` flag; this is short for `--set-upstream`, which configures the branches for easier pushing and pulling later.
cs: Všimněte si též příznaku `-u`. Jde o zkratku pro volbu `--set-upstream`, která se používá k nastavení větví pro pozdější zjednodušené odesílání (push) a stahování (pull).

source: Also the `--no-commit` option can be useful to delay the merge commit in case of the default merge process.
cs: V případě základního procesu slučování (merge) může být užitečná i volba `--no-commit`, která oddálí vytvoření bodu sloučení.

source: Also, although the blob content can be nearly anything, the commit and tree content are very specifically formatted.
cs: A navíc, zatímco obsahem blobu může být téměř cokoliv, obsah revize nebo stromu má velmi specifický formát.

source: Also, as long as you stay out of contact with your origin server, your `origin/master` pointer doesn't move.
cs: A dokud nenavážete se serverem `origin` kontakt, nebude se váš ukazatel `origin/master` posunovat.

source: Also, because we're recording the parents when we commit, finding a proper merge base for merging is automatically done for us and is generally very easy to do.
cs: A protože při zapisování objektů revize zaznamenáváme i jeho rodiče, probíhá automaticky i vyhledání správných zdrojů pro slučování, které se pak většinou dělá velmi snadno.

source: Also, if you include instructions in the tag message, running `git show <tag>` will let you give the end user more specific instructions about tag verification.
cs: Pokud navíc zadáte do zprávy značky další instrukce k jejímu ověření, může si je koncový uživatel zobrazit příkazem `git show <tag>`.

source: Also, while your choice of graphical client is a matter of personal taste, _all_ users will have the command-line tools installed and available.
cs: A zatímco váš výběr grafického klienta závisí na osobních preferencích, příkazový řádek mají nainstalován a k dispozici _všichni_ uživatelé.

source: Alternatively, you can type your commit message inline with the `commit` command by specifying it after a -m flag, like this:
cs: Zprávu k revizi můžete napsat také do řádku k příkazu `commit` tak, že ji uvedete za volbu `-m`:

source: Although Subversion automatically does such a merge on the server if different files are edited, in Git you must merge the commits locally.
cs: Pokud byly upraveny různé soubory, provádí Subversion takové sloučení na serveru automaticky. Ale v Gitu musíte provést sloučení revizí (merge) lokálně.

source: Although `git status` answers those questions very generally by listing the file names, `git diff` shows you the exact lines added and removed – the patch, as it were.
cs: Ačkoliv příkaz `git status` vám tyto otázky velmi obecně odpoví, příkaz `git diff` přesně zobrazí přidané a odstraněné řádky -- jakoby v podobě záplaty.

source: Although this operation may take only a few minutes, if you try to copy the original repository to another remote repository instead of a local one, the process will take nearly an hour, even though there are fewer than 100 commits.
cs: Tato operace bude trvat jen několik minut. Pokud byste se však pokoušeli zkopírovat originální repozitář ne do lokálního, nýbrž do jiného vzdáleného repozitáře, protáhne se proces téměř na hodinu, přestože repozitář obsahuje necelých 100 revizí.

source: Although you can technically push changes to and pull changes from individuals' repositories, doing so is discouraged because you can fairly easily confuse what they're working on if you're not careful.
cs: Technicky vzato sice můžete odesílat a stahovat změny z repozitářů jednotlivých spolupracovníků, ale tento přístup se nedoporučuje, protože si při troše neopatrnosti můžete velmi snadno poplést, kdo na čem pracuje.

source: Although you may have legitimate merge issues, you know where in your history their work is based; a proper three-way merge is the default rather than having to supply a `-3` and hope the patch was generated off a public commit to which you have access.
cs: Přestože můžete mít oprávněné problémy se slučováním, víte, kde ve své historii můžete hledat příčiny. Řádné třícestné sloučení je vždy lepším řešením, než zadat parametr `-3` a doufat, že byl patch vygenerován z veřejné revize, k níž máte přístup.

source: Amazing.
cs: Úžasné!

source: An OSX Git installer is maintained and available for download at the Git website, at http://git-scm.com/download/mac[].
cs: Instalátor Gitu pro OSX se udržuje na webové stránce Gitu http://git-scm.com/download/mac[] a můžete si jej odtud stáhnout.

source: An alternative would be to push this new work to a different branch on the server (perhaps called `featureAv2`).
cs: Druhou možností by bylo odeslání nové práce na server do jiné větve (nazvané třeba `featureAv2`).

source: An annotated tag is more complex, however.
cs: Anotovaná značka je už složitější.

source: An asterisk (`*`) matches zero or more characters; `[abc]` matches any character inside the brackets (in this case a, b, or c); a question mark (`?`) matches a single character; and brackets enclosing characters separated by a hyphen(`[0-9]`) matches any character between them (in this case 0 through 9).
cs: Hvězdička (`*`) označuje žádný nebo více znaků; `[abc]` označuje jakýkoli znak uvedený v závorkách (v tomto případě `a`, `b` nebo `c`); otazník (`?`) označuje jeden znak; znaky v hranatých závorkách oddělené pomlčkou (`[0-9]`) označují jakýkoli znak v daném rozmezí (v našem případě 0 až 9).

source: And if it was changed since it was checked out but has not been staged, it is modified.
cs: A pokud byl vůči stavu v databázi upraven, ale nebyl připraven k zapsání, je ve stavu „změněný“.

source: And then define a dummy `ours` merge strategy with:
cs: A potom nadefinujete prázdnou slučovací strategii `ours` příkazem:

source: And what have you staged that you are about to commit?
cs: A co jste připravili k zapsání?

source: And you can specify older commits with this data, as well.
cs: Pomocí těchto dat lze rovněž specifikovat starší revize.

source: And you did all that with simple `branch`, `checkout`, and `commit` commands.
cs: To vše jste provedli pomocí jednoduchých příkazů `branch`, `checkout` a `commit`.

source: Annotated tags, however, are stored as full objects in the Git database.
cs: Naproti tomu anotované značky jsou ukládány jako plné objekty v databázi Gitu.

source: Annotating a file helps if you know where the issue is to begin with.
cs: Anotace souboru má smysl, pokud víte, kde problém hledat.

source: Another cool thing about Git is that it doesn’t track file renames explicitly.
cs: Další skvělou věcí na systému Git je, že explicitně nesleduje přejmenování souboru.

source: Another easy way to get Git installed is by installing GitHub for Windows.
cs: Další snadný způsob pro nainstalování Gitu spočívá v nainstalování GitHub for Windows.

source: Another interesting example gets `$Date$` keyword expansion, RCS style.
cs: Další zajímavý příklad se týká rozšíření klíčového slova `$Date$` ve stylu RCS.

source: Another interesting problem you can solve this way involves diffing image files.
cs: Dalším zajímavým problémem, který lze tímto způsobem řešit, je výpočet rozdílů u obrázkových souborů.

source: Another really helpful filter is the `-S` option which takes a string and only shows the commits that introduced a change to the code that added or removed that string.
cs: Dalším opravdu užitečným filtrem je volba `-S`, které zadáme nějaký řetězec. Způsobí, že se zobrazí jen revize se změnami kódu, kdy byl zadaný řetězec přidán nebo odstraněn.

source: Another really useful option is `--pretty`.
cs: Další opravdu užitečnou volbou je `--pretty`.

source: Another useful thing you may want to do is to keep the file in your working tree but remove it from your staging area.
cs: Další užitečnou věcí, kterou byste mohli chtít, je možnost zachování souboru v pracovním stromu při současném odstranění z oblasti připravených změn.

source: Another very frequent use of this syntax is to see what you’re about to push to a remote:
cs: Tato syntaxe se velmi často používá také ke zjištění, co hodláte odeslat do vzdálené větve:

source: Another way to do it is to have your SSH server authenticate from an LDAP server or some other centralized authentication source that you may already have set up.
cs: Dalším možným způsobem je nechat ověřovat SSH přístupy LDAP serveru nebo jinému centralizovanému zdroji ověření, který už možná máte nastavený.

source: Any changes you made to that file are gone – you just copied another file over it.
cs: Veškeré změny, které jste v souboru provedli, jsou ztraceny -- soubor jste právě překopírovali jiným souborem.

source: Anything that has merge conflicts and hasn't been resolved is listed as unmerged.
cs: Vše, u čeho při slučování vznikl konflikt, který nebyl vyřešen, je označeno jako „unmerged“ (nesloučeno).

source: Anything you didn't stage is still sitting there modified; you can do another commit to add it to your history.
cs: Vše, co jste nepřipravili k zapsání, zůstane ve stavu změněno na vašem disku. Můžete provést další zápis a přidat to také do vaší historie.

source: Are all the patches peer-reviewed and approved?
cs: Jsou všechny záplaty odborně posuzovány a schvalovány?

source: Are you involved in that process?
cs: Jste součástí tohoto procesu?

source: As I write this introduction, GitHub is announcing our 10 millionth hosted project, with nearly 5 million registered developer accounts and over 230 employees.
cs: V době, kdy píši tuto předmluvu, oznámil GitHub 10milióntý hostovaný projekt s téměř 5 milióny registrovaných vývojářských účtů a s více než 230 zaměstnanci.

source: As a general rule, your messages should start with a single line that's no more than about 50 characters and that describes the changeset concisely, followed by a blank line, followed by a more detailed explanation.
cs: Základním pravidlem je, že by vaše zprávy měly začínat jedním řádkem, který nemá víc než asi 50 znaků a který popisuje sadu provedených změn. Za ním následuje prázdný řádek a potom podrobnější vysvětlení.

source: As an example, if you commit and then realize you forgot to stage the changes in a file you wanted to add to this commit, you can do something like this:
cs: Pokud například zapíšete revizi a potom si uvědomíte, že jste zapomněli připravit k zapsání změny v souboru, který jste chtěli do této revize přidat, můžete provést následující:

source: As before, you can set each value separately with a series of `git config` commands, or you can add them manually in the sendemail section in your `~/.gitconfig` file:
cs: Stejně jako v předchozím případu můžete nastavit sérií příkazů `git config` každou hodnotu zvlášť, nebo je můžete vložit ručně do sekce sendemail souboru `~/.gitconfig`:

source: As in any VCS, you can lose or mess up changes you haven't committed yet; but after you commit a snapshot into Git, it is very difficult to lose, especially if you regularly push your database to another repository.
cs: Stejně jako v jiných systémech pro správu verzí můžete ztratit nebo poničit úpravy, které ještě nebyly zapsány. Jakmile však snímek zapíšete do Gitu, je téměř nemožné ho ztratit, zvlášť pokud databázi pravidelně odesíláte (push) do jiného repozitáře.

source: As long as each user can get shell access on the machine, any SSH authentication mechanism you can think of should work.
cs: Dokud má každý uživatel shellový přístup k počítači, měly by fungovat všechny mechanismy ověřování SSH, které vás jen napadnou.

source: As with many great things in life, Git began with a bit of creative destruction and fiery controversy.
cs: Git se zrodil, stejně jako mnoho velkých věcí v životě, z kreativní destrukce a vášnivého sporu.

source: As you can see, the `--stat` option prints below each commit entry a list of modified files, how many files were changed, and how many lines in those files were added and removed.
cs: Jak vidíte, volba `--stat` vypíše pod každým záznamem revize seznam změněných souborů, kolik souborů bylo změněno (changed) a kolik řádků bylo v těchto souborech vloženo (insertions) a smazáno (deletions).

source: As you can see, this command lists each commit with its SHA-1 checksum, the author's name and email, the date written, and the commit message.
cs: Jak vidíte, tento příkaz vypíše všechny revize s jejich kontrolním součtem SHA-1, jménem a e-mailem autora, datem zápisu a zprávou o revizi.

source: As you can see, when it completes successfully, it gives you a bunch of statistics about what it accomplished.
cs: Proběhne-li proces úspěšně, podá vám obsáhlou statistiku o tom, co bylo provedeno.

source: As you can tell, Git simply replaces the new command with whatever you alias it for.
cs: Jak tušíte, Git jednoduše nahradí nový příkaz čímkoliv, co jste aliasem pojmenovali.

source: As you edit files, Git sees them as modified, because you've changed them since your last commit.
cs: Jakmile soubory editujete, začne je Git považovat za změněné, protože jste v nich od posledního zápisu revize provedli změny.

source: As you go on using Git, you'll probably use other commands frequently as well; don't hesitate to create new aliases.
cs: Během používání Gitu budete asi častěji používat i jiné příkazy. Neváhejte a vytvořte si pro ně nové aliasy.

source: As you just saw, to get data from your remote projects, you can run:(((git commands, fetch)))
cs: Jak jste právě viděli, můžete pro získání dat vzdáleného projektu použít příkaz:(((git commands, fetch)))

source: As you learn Git, try to clear your mind of the things you may know about other VCSs, such as Subversion and Perforce; doing so will help you avoid subtle confusion when using the tool.
cs: Při seznamování s Gitem se pokuste vyčistit mysl od věcí, které možná znáte z jiných systémů pro správu verzí, jako jsou Subversion a Perforce. Při jeho používání se tím vyhnete určitým zmatkům.

source: As you may remember from <<_getting_started>>, Git doesn't store data as a series of changesets or differences, but instead as a series of snapshots.
cs: Jak si možná vzpomínáte z kapitoly <<_getting_started>>, Git neukládá data jako sérii změn nebo rozdílů, ale jako sérii snímků.

source: As you may remember, Git is fundamentally a linked list of commit objects that point to a snapshot of content.
cs: Jak si možná vzpomínáte, říkali jsme, že Git je v podstatě seznam odkazů na objekty revizí, které ukazují na určitý snímek obsahu.

source: As you start making commits, you're given a `master` branch that points to the last commit you made.
cs: Když vytváříte objekt revize, máte k dispozici větev `master`, která ukazuje na váš minulý objekt revize.

source: Assuming she already has her repository cloned, she decides to work on `featureA` first.
cs: Protože už má naklonovaný repozitář, rozhodne se pracovat nejprve na úkolu `featureA`.

source: Assuming this happens, how can you get your commits back?
cs: Pokud se už něco takového stane, jak dostanete své revize zpět?

source: Assuming you saved the patch at `/tmp/patch-ruby-client.patch`, you can apply the patch like this:
cs: Předpokládejme, že jste záplatu uložili jako `/tmp/patch-ruby-client.patch`. Aplikaci pak provedete takto:

source: At any stage, you may want to undo something.
cs: Kdykoli se může stát, že něco chcete vrátit do původního stavu.

source: At some point in your Git journey, you may accidentally lose a commit.
cs: Někdy se může stát, že nedopatřením přijdete o revizi Git.

source: At some point, you may want to convert your existing project to Git.
cs: V určitém okamžiku možná budete chtít přepnout svůj existující projekt do systému Git.

source: At that point, anyone who can access the web server under which you put the repository can also clone your repository.
cs: Tím je nastavení hotové. V tuto chvíli může každý, kdo má přístup na webový server, kam jste repozitář uložili, tento repozitář naklonovat.

source: At that point, everyone will be able to access that machine via the 'git' user.
cs: Nyní budou mít všichni přístup k tomuto počítači prostřednictvím uživatele 'git'.

source: At the end of this chapter you should understand why Git is around, why you should use it and you should be all set up to do so.
cs: Na konci kapitoly byste měli rozumět tomu, proč tady Git je, proč byste jej měli používat a měli byste být na jeho používání připraveni.

source: At the time of publishing there were maybe a few thousand people using the site and just four of us working on it.
cs: V době spuštění jej používalo možná pár tisíc lidí a vyvíjeli jsme ho čtyři.

source: At this point, John's local repository looks something like this:
cs: V tomto okamžiku vypadá Johnův lokální repozitář nějak takto:

source: At this point, nothing in your project is tracked yet.
cs: V tomto okamžiku se z vašeho projektu ještě nic nesleduje.

source: At this point, other users who have SSH access to the same server which has read-access to the `/opt/git` directory can clone your repository by running
cs: V tomto okamžiku mohou všichni ostatní, kdo mají SSH přístup k tomuto serveru s oprávněním pro čtení k adresáři `/opt/git`, naklonovat váš repozitář příkazem:

source: At this point, she needs to share her work with John, so she pushes her `featureA` branch commits up to the server.
cs: V tomto okamžiku potřebuje sdílet svou práci s Johnem, a tak odešle revize své větve `featureA` na server.

source: At this point, suppose you remember one little change that you want to make in `CONTRIBUTING.md` before you commit it.
cs: Nyní předpokládejme, že jste si vzpomněli na jednu malou změnu, kterou chcete v souboru `CONTRIBUTING.md` provést ještě před zapsáním revize.

source: At this point, the others can clone it down and push changes back up just as easily:
cs: Ostatní nyní mohou velmi snadno repozitář naklonovat i do něj odesílat změny:

source: At this point, you can do all the basic local Git operations – creating or cloning a repository, making changes, staging and committing those changes, and viewing the history of all the changes the repository has been through.
cs: V tomto okamžiku už v Gitu umíte provádět všechny základní lokální operace -- vytvořit a klonovat repozitář, provádět změny, připravit je k zapsání, zapsat je a prohlížet si historii všech změn, kterými repozitář prošel.

source: At this point, you can easily switch branches and do work elsewhere; your changes are stored on your stack.
cs: Nyní můžete bez obav přepnout větve a pracovat na jiném úkolu, vaše změny byly uloženy do zásobníku.

source: At this point, you can exit the interactive adding script and run `git commit` to commit the partially staged files.
cs: V tomto okamžiku můžete ukončit skript interaktivního přidávání a spustit příkaz `git commit`, jímž zapíšete částečně připravené soubory.

source: At this point, you can go back to the `master` branch and do a fast-forward merge.
cs: V tomto okamžiku můžete přejít zpět na větev `master` a provést sloučení typu „rychle vpřed“.

source: At this point, you can run your test to see if the issue exists as of this commit.
cs: Nyní můžete provést testování a vyzkoušet, zda problém existuje i v této revizi.

source: At this point, you have a Git repository with tracked files and an initial commit.
cs: V této chvíli máte vytvořen gitový repozitář se sledovanými soubory a úvodní revizí.

source: At this point, you should be able to do most of the things in Git that you’ll need on the command line day to day and feel comfortable doing so.
cs: V této chvíli byste měli v systému Git zvládat většinu úkonů, které se běžně používají na příkazovém řádku, a neměly by vám činit větší potíže.

source: At this point, you should have a valid Git repository that has imported your branches and tags:
cs: V tomto okamžiku byste tedy měli mít platný repozitář Git s importovanými větvemi a značkami:

source: At this point, your project working directory is exactly the way it was before you started working on issue #53, and you can concentrate on your hotfix.
cs: V tomto okamžiku vypadá váš pracovní adresář přesně tak, jak vypadal, než jste začali pracovat na problému #53, a vy se nyní můžete soustředit na požadovanou opravu.

source: At this stage, you'll receive a call that another issue is critical and you need a hotfix.
cs: V tomto okamžiku vám zavolají, že se vyskytla jiná kritická chyba, která vyžaduje rychlou opravu (hotfix).

source: Basically all this does is remove the pointer from the server.
cs: V podstatě vše, co to udělá, je jen odstranění odkazu ze serveru.

source: Be careful, because you can't always undo some of these undos.
cs: Ale buďte opatrní, protože ne vždy můžete návrat zpět vrátit zase vpřed.
